{"class_name": "Functional", "config": {"name": "model_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_163"}, "name": "input_163", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_164"}, "name": "input_164", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_165"}, "name": "input_165", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_166"}, "name": "input_166", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_167"}, "name": "input_167", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_168"}, "name": "input_168", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_169"}, "name": "input_169", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_170"}, "name": "input_170", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_171"}, "name": "input_171", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_172"}, "name": "input_172", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_173"}, "name": "input_173", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_174"}, "name": "input_174", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_175"}, "name": "input_175", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_176"}, "name": "input_176", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_177"}, "name": "input_177", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_178"}, "name": "input_178", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_179"}, "name": "input_179", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_180"}, "name": "input_180", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_324", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_324", "inbound_nodes": [[["input_163", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_326", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_326", "inbound_nodes": [[["input_164", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_328", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_328", "inbound_nodes": [[["input_165", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_330", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_330", "inbound_nodes": [[["input_166", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_332", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_332", "inbound_nodes": [[["input_167", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_334", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_334", "inbound_nodes": [[["input_168", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_336", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_336", "inbound_nodes": [[["input_169", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_338", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_338", "inbound_nodes": [[["input_170", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_340", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_340", "inbound_nodes": [[["input_171", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_342", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_342", "inbound_nodes": [[["input_172", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_344", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_344", "inbound_nodes": [[["input_173", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_346", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_346", "inbound_nodes": [[["input_174", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_348", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_348", "inbound_nodes": [[["input_175", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_350", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_350", "inbound_nodes": [[["input_176", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_352", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_352", "inbound_nodes": [[["input_177", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_354", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_354", "inbound_nodes": [[["input_178", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_356", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_356", "inbound_nodes": [[["input_179", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_358", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_358", "inbound_nodes": [[["input_180", 0, 0, {}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_162", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_162", "inbound_nodes": [[["layer_normalization_324", 0, 0, {"value": ["layer_normalization_324", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_163", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_163", "inbound_nodes": [[["layer_normalization_326", 0, 0, {"value": ["layer_normalization_326", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_164", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_164", "inbound_nodes": [[["layer_normalization_328", 0, 0, {"value": ["layer_normalization_328", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_165", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_165", "inbound_nodes": [[["layer_normalization_330", 0, 0, {"value": ["layer_normalization_330", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_166", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_166", "inbound_nodes": [[["layer_normalization_332", 0, 0, {"value": ["layer_normalization_332", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_167", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_167", "inbound_nodes": [[["layer_normalization_334", 0, 0, {"value": ["layer_normalization_334", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_168", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_168", "inbound_nodes": [[["layer_normalization_336", 0, 0, {"value": ["layer_normalization_336", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_169", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_169", "inbound_nodes": [[["layer_normalization_338", 0, 0, {"value": ["layer_normalization_338", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_170", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_170", "inbound_nodes": [[["layer_normalization_340", 0, 0, {"value": ["layer_normalization_340", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_171", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_171", "inbound_nodes": [[["layer_normalization_342", 0, 0, {"value": ["layer_normalization_342", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_172", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_172", "inbound_nodes": [[["layer_normalization_344", 0, 0, {"value": ["layer_normalization_344", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_173", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_173", "inbound_nodes": [[["layer_normalization_346", 0, 0, {"value": ["layer_normalization_346", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_174", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_174", "inbound_nodes": [[["layer_normalization_348", 0, 0, {"value": ["layer_normalization_348", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_175", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_175", "inbound_nodes": [[["layer_normalization_350", 0, 0, {"value": ["layer_normalization_350", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_176", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_176", "inbound_nodes": [[["layer_normalization_352", 0, 0, {"value": ["layer_normalization_352", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_177", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_177", "inbound_nodes": [[["layer_normalization_354", 0, 0, {"value": ["layer_normalization_354", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_178", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_178", "inbound_nodes": [[["layer_normalization_356", 0, 0, {"value": ["layer_normalization_356", 0, 0]}]]]}, {"class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_179", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 64, "value_dim": 64, "dropout": 0.1, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 100, 1], "key_shape": [null, 100, 1], "value_shape": [null, 100, 1]}, "name": "multi_head_attention_179", "inbound_nodes": [[["layer_normalization_358", 0, 0, {"value": ["layer_normalization_358", 0, 0]}]]]}, {"class_name": "Add", "config": {"name": "add_324", "trainable": true, "dtype": "float32"}, "name": "add_324", "inbound_nodes": [[["input_163", 0, 0, {}], ["multi_head_attention_162", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_326", "trainable": true, "dtype": "float32"}, "name": "add_326", "inbound_nodes": [[["input_164", 0, 0, {}], ["multi_head_attention_163", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_328", "trainable": true, "dtype": "float32"}, "name": "add_328", "inbound_nodes": [[["input_165", 0, 0, {}], ["multi_head_attention_164", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_330", "trainable": true, "dtype": "float32"}, "name": "add_330", "inbound_nodes": [[["input_166", 0, 0, {}], ["multi_head_attention_165", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_332", "trainable": true, "dtype": "float32"}, "name": "add_332", "inbound_nodes": [[["input_167", 0, 0, {}], ["multi_head_attention_166", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_334", "trainable": true, "dtype": "float32"}, "name": "add_334", "inbound_nodes": [[["input_168", 0, 0, {}], ["multi_head_attention_167", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_336", "trainable": true, "dtype": "float32"}, "name": "add_336", "inbound_nodes": [[["input_169", 0, 0, {}], ["multi_head_attention_168", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_338", "trainable": true, "dtype": "float32"}, "name": "add_338", "inbound_nodes": [[["input_170", 0, 0, {}], ["multi_head_attention_169", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_340", "trainable": true, "dtype": "float32"}, "name": "add_340", "inbound_nodes": [[["input_171", 0, 0, {}], ["multi_head_attention_170", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_342", "trainable": true, "dtype": "float32"}, "name": "add_342", "inbound_nodes": [[["input_172", 0, 0, {}], ["multi_head_attention_171", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_344", "trainable": true, "dtype": "float32"}, "name": "add_344", "inbound_nodes": [[["input_173", 0, 0, {}], ["multi_head_attention_172", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_346", "trainable": true, "dtype": "float32"}, "name": "add_346", "inbound_nodes": [[["input_174", 0, 0, {}], ["multi_head_attention_173", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_348", "trainable": true, "dtype": "float32"}, "name": "add_348", "inbound_nodes": [[["input_175", 0, 0, {}], ["multi_head_attention_174", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_350", "trainable": true, "dtype": "float32"}, "name": "add_350", "inbound_nodes": [[["input_176", 0, 0, {}], ["multi_head_attention_175", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_352", "trainable": true, "dtype": "float32"}, "name": "add_352", "inbound_nodes": [[["input_177", 0, 0, {}], ["multi_head_attention_176", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_354", "trainable": true, "dtype": "float32"}, "name": "add_354", "inbound_nodes": [[["input_178", 0, 0, {}], ["multi_head_attention_177", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_356", "trainable": true, "dtype": "float32"}, "name": "add_356", "inbound_nodes": [[["input_179", 0, 0, {}], ["multi_head_attention_178", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_358", "trainable": true, "dtype": "float32"}, "name": "add_358", "inbound_nodes": [[["input_180", 0, 0, {}], ["multi_head_attention_179", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_325", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_325", "inbound_nodes": [[["add_324", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_327", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_327", "inbound_nodes": [[["add_326", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_329", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_329", "inbound_nodes": [[["add_328", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_331", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_331", "inbound_nodes": [[["add_330", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_333", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_333", "inbound_nodes": [[["add_332", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_335", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_335", "inbound_nodes": [[["add_334", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_337", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_337", "inbound_nodes": [[["add_336", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_339", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_339", "inbound_nodes": [[["add_338", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_341", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_341", "inbound_nodes": [[["add_340", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_343", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_343", "inbound_nodes": [[["add_342", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_345", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_345", "inbound_nodes": [[["add_344", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_347", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_347", "inbound_nodes": [[["add_346", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_349", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_349", "inbound_nodes": [[["add_348", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_351", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_351", "inbound_nodes": [[["add_350", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_353", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_353", "inbound_nodes": [[["add_352", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_355", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_355", "inbound_nodes": [[["add_354", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_357", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_357", "inbound_nodes": [[["add_356", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_359", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_359", "inbound_nodes": [[["add_358", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_513", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_513", "inbound_nodes": [[["layer_normalization_325", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_516", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_516", "inbound_nodes": [[["layer_normalization_327", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_519", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_519", "inbound_nodes": [[["layer_normalization_329", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_522", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_522", "inbound_nodes": [[["layer_normalization_331", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_525", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_525", "inbound_nodes": [[["layer_normalization_333", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_528", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_528", "inbound_nodes": [[["layer_normalization_335", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_531", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_531", "inbound_nodes": [[["layer_normalization_337", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_534", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_534", "inbound_nodes": [[["layer_normalization_339", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_537", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_537", "inbound_nodes": [[["layer_normalization_341", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_540", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_540", "inbound_nodes": [[["layer_normalization_343", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_543", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_543", "inbound_nodes": [[["layer_normalization_345", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_546", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_546", "inbound_nodes": [[["layer_normalization_347", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_549", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_549", "inbound_nodes": [[["layer_normalization_349", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_552", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_552", "inbound_nodes": [[["layer_normalization_351", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_555", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_555", "inbound_nodes": [[["layer_normalization_353", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_558", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_558", "inbound_nodes": [[["layer_normalization_355", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_561", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_561", "inbound_nodes": [[["layer_normalization_357", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_564", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_564", "inbound_nodes": [[["layer_normalization_359", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_514", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_514", "inbound_nodes": [[["dense_513", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_517", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_517", "inbound_nodes": [[["dense_516", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_520", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_520", "inbound_nodes": [[["dense_519", 0, 0, 